[
    {
        "id": 0,
        "name": "FireChakra",
        "description": "Personal assistant web app with React.js, Chakra UI, and Firebase Firestore.",
        "summary": "FireChakra is a mobile-responsive web application designed to serve as an organizer, personal assistant, and planner for users. It was built using HTML, CSS, JavaScript, React.js, Chakra UI, Next.js, and Firebase Firestore. \n \n The app's user interface is built with Chakra UI, ensuring that the app is both user-friendly and aesthetically pleasing. Firebase Firestore is used as the database for this web app, providing users with a secure and scalable way to store their data. Next.js is used as the web framework, providing benefits such as server-side rendering, automatic code splitting, and optimized performance. Authentication functionality is included, allowing users to use their existing Google account to securely log in. This ensures that users' data is kept safe and accessible only to authorized individuals. FireChakra is deployed on the cloud platform Vercel, ensuring that the app is fast, reliable, and easy to deploy. \n \nFireChakra is a powerful tool for anyone looking to stay organized, manage their tasks, and stay on top of their schedule.",
        "date": "October 25, 2022",
        "screenshot": "/fc_ss.png",
        "livelink": "https://firechakra.vercel.app/"
    },
    {
        "id": 1,
        "name": "April's Closet",
        "description": "Concept eCommerce website + custom WordPress classic theme",
        "summary": "April's Closet is a concept eCommerce apparel website built using HTML, CSS, JavaScript, PHP, MySQL, WordPress, and the WooCommerce plugin for WordPress. The website is designed to showcase a demo of a small business that sells clothing items online. \n \nThe website's design features a mobile-responsive WordPress classic theme, which was custom-built from scratch to meet the specific requirements of the project. The design is optimized for viewing on mobile devices, ensuring that customers can easily browse and purchase clothing items using their smartphones or tablets. The website uses the WooCommerce plugin for WordPress, which provides a powerful and user-friendly eCommerce platform. This allows customers to add items to their cart, checkout, and pay for their purchases securely. April's Closet is built using a combination of HTML, CSS, JavaScript, and PHP, which allows for flexibility and customization. The MySQL database is used to store and manage the website's data, including product information, customer orders, and other relevant details. \n \nThe WordPress content management system (CMS) is used to manage the website's content, including pages, posts, and product descriptions. This provides an easy way for the website owner to update and manage their website's content. The website is also integrated with various third-party services, including payment gateways and shipping providers. This ensures that customers can pay for their purchases securely and have their items shipped to them quickly and reliably. \n \nApril's Closet is one example of how to build a powerful eCommerce website that showcases the capabilities of WordPress and the WooCommerce plugin. With its mobile-responsive design, powerful eCommerce features, and easy-to-use content management system, it is an ideal choice for small businesses looking to establish an online presence and sell their products online.",
        "date": "July 24, 2022",
        "screenshot": "/ac_ss.png",
        "livelink": "none"
    }
]