[
    {
        "id": 0,
        "name": "FireChakra",
        "description": "Personal assistant web app with React.js, Chakra UI, and Firebase Firestore.",
        "summary": "FireChakra is a mobile-responsive web application designed to serve as an organizer, personal assistant, and planner for users. It was built using HTML, CSS, JavaScript, React.js, Chakra UI, Next.js, and Firebase Firestore. \n \n Firebase Firestore is used as the database for this web app, providing users with a secure and scalable way to store their data. Next.js is used as the web framework, providing benefits such as server-side rendering, automatic code splitting, and optimized performance. Authentication functionality is included, allowing users to use their existing Google account to securely log in. This ensures that users' data is kept safe and accessible only to authorized individuals.",
        "date": "October 25, 2022",
        "screenshot": "/fc_ss.png",
        "livelink": "https://firechakra.vercel.app/"
    },
    {
        "id": 1,
        "name": "Bikeable Santa Rosa",
        "description": "WordPress-powered news and events website for a local community activist group promoting safer city streets.",
        "summary": "Bikeable Santa Rosa is a local coalition seeking to promote the construction of a safe, low-stress bicycle network in urban Santa Rosa. \n \n The stakeholders identified the project goals as 1) full site redesign in order to better reflect the organization's emphasis on diversity and inclusion, 2) provide the public with information about the organization and its events, and 3) increase membership of their email distribution list. \n \n In order to meet these objectives, WordPress was selected as the content management system due to its ease of use. Through multiple rounds of design iteration, the client's vision was brought to life, and integration between WordPress and the client's MailChimp account was seamless. \n \n Throughout the process, our team was mindful of the need for a mobile-responsive design, full accessibility across all pages and content, and a general information hierarchy that would enable a very approachable user experience.",
        "date": "May 18, 2023",
        "screenshot": "/bsr-hp-ss.png",
        "livelink": "https://docs.google.com/presentation/d/e/2PACX-1vS3CXjCGfhkWKTk8kh4Ug1fzg0GTJMsza2hU6xMIYOS18d1RZ_WMsaQXFJWFu50GRyJ69HoqsBYhufc/pub?start=false&loop=false&delayms=3000"
    }
]